// 1.ผลลัพธ์ทั้ง console.log ทั้งสามคืออะไร

hello 1

hello name

hello Codecamp

// 2.
// 2.1. กำหนดตัวแปรสำหรับเก็บชื่อ และกำหนดค่าเริ่มต้นเป็นชื่อของผู้เรียน
 let name = 'Phairoj'

// 2.2. กำหนดตัวแปรสำหรับเก็บอายุ และกำหนดค่าเริ่มต้นเป็นอายุของผู้เรียน
let age = 43;

// 2.3. กำหนดตัวแปรสำหรับเก็บที่อยู่ และกำหนดค่าเริ่มต้นเป็นที่อยู่ของผู้เรียน
let address = "25/2 Moo2 Tasala, Muaeng, Chiangmai";

// 2.4. กำหนดตัวแปรสำหรับเก็บประวัติของนักเรียนโดยใช้ตัวแปรทั้ง 3 ตัวด้านบนประกอบการเขียนประวัตินี้ด้วย

let myRecord = `My name is ${name}. I am ${age} years old. I live at ${address}`;
