// Exercise for และ while
1.เลขที่ถูก alert เป็นลำดับสุดท้ายคือเลขอะไร  //  1

2.code ทั้งสองอันนี้จะแสดง alert ออกมาเหมือนกันทั้งหมดหรือไม่ // ไม่เหมือน ++i ได้ 1,2,3,4  i++ ได้ 1,2,3,4,5


3.code ทั้งสองอันนี้จะแสดง alert ออกมาเหมือนกันทั้งหมดหรือไม่ // เหมือนกัน


// 4.ให้เขียน loop ทั้งแสดงเลข 2 ถึง 10 ออกมา 

for (let i = 2; i < 11; i++) {
    console.log(i);
}

// 5.เปลี่ยน code for loop ด้านล่างนี้ให้เป็น while loop โดยที่ผลลัพธ์ยังเหมือนเดิม

let i = 0;
while (i < 3) {
    alert( `number ${i}!` );
    i += 1;
}

// 6.ให้เขียนเกมส์ทายตัวเลขสำหรับเล่นสองคน โดย
// - ให้ผู้เล่นคนแรกพิมพ์เลขใส่ใน prompt ที่อยู่ระหว่าง 1 ถึง 100 โดยไม่ให้ผู้เล่นคนที่สองรู้ว่าตัวเลขเป็นอะไร
// - และให้ผู้เล่นคนที่สองทายเลขโดยการพิมพ์เลขใส่ใน prompt จนกว่าจะถูก ถ้าไม่ถูก จะต้องบอกด้วยว่าเลขที่ผู้เล่นคนที่สองพิมพ์เข้ามา มากกว่า หรือ น้อยกว่าคำตอบนั้น

let code = +prompt("Player1 Enter code to gues (1-100): ");
let guess = +prompt("Player2 guess: ");
while (guess != code) {
    if( guess > code) {
        alert("Too high");
    } else if (guess < code) {
        alert("Too low");
    }
    guess = +prompt("Player2 guess: ");
}